let kiruvchi1 = document.querySelector(".kiruvchi1");
let kiruvchi2 = document.querySelector(".kiruvchi2");
let kiruvchi3 = document.querySelector(".kiruvchi3");
let kiruvchi4 = document.querySelector(".kiruvchi4");

let newArr1 = [];

// а б в г д е ё ж з и й к л м н о п р с т у ф х ц ч ш щ ъ ы ь э ю я
// a b d e f g h i j k l m n o p q r s t u v x y z o` g` sh ch ng

let lotinKril = function (lotincha) {
  let lotin = new Map([
    ["A", "А"],
    ["B", "Б"],
    ["C", "С"],
    ["D", "Д"],
    ["E", "Е"],
    ["F", "Ф"],
    ["G", "Г"],
    ["H", "Х"],
    ["I", "И"],
    ["J", "Ж"],
    ["K", "К"],
    ["L", "Л"],
    ["M", "М"],
    ["N", "Н"],
    ["O", "О"],
    ["P", "П"],
    ["Q", "К"],
    ["R", "Р"],
    ["S", "С"],
    ["T", "Т"],
    ["U", "У"],
    ["V", "В"],
    ["X", "Х"],
    ["Y", "Й"],
    ["Z", "З"],
    ["Ya", "Я"],
    ["Yu", "Ю"],
    ["Sh", "Щ"],
    ["Ch", "Ч"],
    ["a", "а"],
    ["b", "б"],
    ["c", "с"],
    ["d", "д"],
    ["e", "е"],
    ["f", "ф"],
    ["g", "г"],
    ["h", "х"],
    ["i", "и"],
    ["j", "ж"],
    ["k", "к"],
    ["l", "л"],
    ["m", "м"],
    ["n", "н"],
    ["o", "о"],
    ["p", "п"],
    ["q", "к"],
    ["r", "p"],
    ["s", "с"],
    ["t", "т"],
    ["u", "у"],
    ["v", "в"],
    ["x", "x"],
    ["y", "й"],
    ["z", "з"],
    ["sh", "щ"],
    ["ch", "ч"],
    ["ya", "я"],
    ["yu", "ю"],
    ["o'", "ў"],
    ["O'", "ў"],
    ["g'", "ғ"],
    ["G'", "Ғ"],
    [" ", " "],
    [".", "."],
    [",", ","],
    ["-", "-"],
    ["/", "/"],
    ["*", "*"],
    ["&", "&"],
    ["%", "%"],
    ["$", "$"],
    ["@", "@"],
    ["!", "!"],
    ["`", "`"],
    ["'", "'"],
    ["|", "|"],
    ["+", "+"],
    ["=", "="],
    ["-", "-"],
    ["_", "_"],
    ["(", "("],
    [")", ")"],
    [";", ";"],
    [":", ":"],
    ["[", "["],
    ["]", "]"],
    ["0", "0"],
    ["1", "1"],
    ["2", "2"],
    ["3", "3"],
    ["4", "4"],
    ["5", "5"],
    ["6", "6"],
    ["7", "7"],
    ["8", "8"],
    ["9", "9"],
  ]);

  let arr = lotincha.split("");
  for (let i = 0; i < arr.length; i++) {
    if (arr[i] === "s" && arr[i + 1] === "h") {
      arr[i] = "sh";
      arr[i + 1] = "";
    }
    if (arr[i] === "c" && arr[i + 1] === "h") {
      arr[i] = "ch";
      arr[i + 1] = "";
    }
    if (arr[i] === "y" && arr[i + 1] === "u") {
      arr[i] = "yu";
      arr[i + 1] = "";
    }
    if (arr[i] === "y" && arr[i + 1] === "a") {
      arr[i] = "ya";
      arr[i + 1] = "";
    }
    if (arr[i] === "S" && arr[i + 1] === "h") {
      arr[i] = "Sh";
      arr[i + 1] = "";
    }
    if (arr[i] === "C" && arr[i + 1] === "h") {
      arr[i] = "Ch";
      arr[i + 1] = "";
    }
    if (arr[i] === "Y" && arr[i + 1] === "u") {
      arr[i] = "Yu";
      arr[i + 1] = "";
    }
    if (arr[i] === "Y" && arr[i + 1] === "a") {
      arr[i] = "Ya";
      arr[i + 1] = "";
    }
    if (arr[i] === "o" && arr[i + 1] === "'") {
      arr[i] = "o'";
      arr[i + 1] = "";
    }
    if (arr[i] === "O" && arr[i + 1] === "'") {
      arr[i] = "O'";
      arr[i + 1] = "";
    }
    if (arr[i] === "g" && arr[i + 1] === "'") {
      arr[i] = "g'";
      arr[i + 1] = "";
    }
    if (arr[i] === "G" && arr[i + 1] === "'") {
      arr[i] = "G'";
      arr[i + 1] = "";
    }
    newArr1.push(lotin.get(arr[i]));
  }
  let answer1 = newArr1.join("");
  kiruvchi2.value = answer1;
};
kiruvchi1.addEventListener("input", () => {
  lotinKril(kiruvchi1.value);
  newArr1 = [];
});

// deshifr
let newArr2 = [];
let krilLotin = function (krilcha) {
  let kril = new Map([
    ["А", "A"],
    ["Б", "B"],
    ["С", "C"],
    ["Д", "D"],
    ["Е", "E"],
    ["Ф", "F"],
    ["Г", "G"],
    ["Х", "H"],
    ["И", "I"],
    ["Ж", "J"],
    ["К", "K"],
    ["Л", "L"],
    ["М", "M"],
    ["Н", "N"],
    ["О", "O"],
    ["П", "P"],
    ["К", "Q"],
    ["Р", "R"],
    ["С", "S"],
    ["Т", "T"],
    ["У", "U"],
    ["В", "V"],
    ["Х", "X"],
    ["Й", "Y"],
    ["З", "Z"],
    ["Я", "Ya"],
    ["Ю", "Yu"],
    ["Щ", "Sh"],
    ["Ч", "Ch"],
    ["а", "a"],
    ["б", "b"],
    ["с", "c"],
    ["д", "d"],
    ["е", "e"],
    ["ф", "f"],
    ["г", "g"],
    ["х", "h"],
    ["и", "i"],
    ["ж", "j"],
    ["к", "k"],
    ["л", "l"],
    ["м", "m"],
    ["н", "n"],
    ["о", "o"],
    ["п", "p"],
    ["к", "q"],
    ["p", "r"],
    ["с", "s"],
    ["т", "t"],
    ["у", "u"],
    ["в", "v"],
    ["x", "x"],
    ["й", "y"],
    ["з", "z"],
    ["щ", "sh"],
    ["ч", "ch"],
    ["я", "ya"],
    ["ю", "yu"],
    [" ", " "],
    [".", "."],
    [",", ","],
    ["-", "-"],
    ["/", "/"],
    ["*", "*"],
    ["&", "&"],
    ["%", "%"],
    ["$", "$"],
    ["@", "@"],
    ["!", "!"],
    ["`", "`"],
    ["'", "'"],
    ["|", "|"],
    ["+", "+"],
    ["=", "="],
    ["-", "-"],
    ["_", "_"],
    ["(", "("],
    [")", ")"],
    [";", ";"],
    [":", ":"],
    ["[", "["],
    ["]", "]"],
    ["0", "0"],
    ["1", "1"],
    ["2", "2"],
    ["3", "3"],
    ["4", "4"],
    ["5", "5"],
    ["6", "6"],
    ["7", "7"],
    ["8", "8"],
    ["9", "9"],
  ]);

  let arr = krilcha.split("");
  for (let i = 0; i < arr.length; i++) {
    newArr2.push(kril.get(arr[i]));
  }

  let answer2 = newArr2.join("");
  kiruvchi4.textContent = answer2;
};
kiruvchi3.addEventListener("input", () => {
  krilLotin(kiruvchi3.value);
  newArr2 = [];
});
